NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21B020F768IM32.svd
        <register>
          <name>IFADCTRIM</name>
          <description></description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x08965290</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFADCCLKSEL</name>
              <description>IFADCCLKSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_2p4g</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_subg</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCENHALFMODE</name>
              <description>IFADCENHALFMODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>full_speed_mode</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>half_speed_mode</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCLDOSERIESAMPLVL</name>
              <description>IFADCLDOSERIESAMPLVL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v1p20</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p24</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p28</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p32</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p35</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p39</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p42</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p46</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCLDOSHUNTAMPLVL</name>
              <description>IFADCLDOSHUNTAMPLVL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v1p20</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p24</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p28</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p32</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p35</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p39</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p42</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p46</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCLDOSHUNTCURLP</name>
              <description>IFADCLDOSHUNTCURLP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_power_disabled</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low_power_enabled</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCLDOSHUNTCURLVL</name>
              <description>IFADCLDOSHUNTCURLVL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>current_180uA</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_190uA</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_200uA</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_210uA</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCOTAST1CURRENT</name>
              <description>IFADCOTAST1CURRENT</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>negative_20p</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>negative_11p</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nominal</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>positive_15p</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCOTAST2CURRENT</name>
              <description>IFADCOTAST2CURRENT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>negative_20p</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>negative_11p</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nominal</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>positive_15p</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCREFBUFAMPLVL</name>
              <description>IFADCREFBUFAMPLVL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0p88</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v0p91</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v0p94</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v0p97</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p00</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p03</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p06</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1p09</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCREFBUFCURLVL</name>
              <description>IFADCREFBUFCURLVL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>current_65uA</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_75uA</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_85uA</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_95uA</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCSIDETONEAMP</name>
              <description>IFADCSIDETONEAMP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>diff_pk_10mV</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>diff_pk_20mV</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>diff_pk_50mV</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>diff_pk_100mV</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCSIDETONEFREQ</name>
              <description>IFADCSIDETONEFREQ</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>na0</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_128</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_64</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_32</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_16</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_8</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_4</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>na7</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCTUNEZERO</name>
              <description>IFADCTUNEZERO</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nominal_zero</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>half_freq_zero</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCVCMLVL</name>
              <description>IFADCVCMLVL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ratio_0p48</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio_0p49</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio_0p5</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio_0p52</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFADCCAL</name>
          <description></description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <resetMask>0x00001F03</resetMask>
          <fields>
            <field>
              <name>IFADCENRCCAL</name>
              <description>IFADCENRCCAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>rccal_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rccal_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCTUNERCCALMODE</name>
              <description>IFADCTUNERCCALMODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYmode</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCmode</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCTUNERC</name>
              <description>IFADCTUNERC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFADCSTATUS</name>
          <description></description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IFADCRCCALOUT</name>
              <description>IFADCRCCALOUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lo</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hi</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LNAMIXTRIM0</name>
          <description></description>
          <addressOffset>0x0E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x0442093D</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXCURCTRL</name>
              <description>LNAMIXCURCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXHIGHCUR</name>
              <description>LNAMIXHIGHCUR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>current_470uA</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_530uA</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unused</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_590uA</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNAMIXLOWCUR</name>
              <description>LNAMIXLOWCUR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>current_nom</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unused</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_80percent</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>current_60percent</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNAMIXRFPKDBWSEL</name>
              <description>LNAMIXRFPKDBWSEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFPKDCALCM</name>
              <description>LNAMIXRFPKDCALCM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFPKDCALDM</name>
              <description>LNAMIXRFPKDCALDM</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXTRIMVREG</name>
              <description>LNAMIXTRIMVREG</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
